malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
                // Formato: fix_mode,GPS_SVs,GLO_SVs,BDS_SVs,lat,N/S,lon,E/W,date,time,alt,spd,...
                int parsed = sscanf(data, "%d,%d,%d,%d,%lf,%c,%lf,%c,%*[^,],%*[^,],%f,%f",
                                    &fix_mode, &gps_svs, &glo_svs, &bds_svs,
                                    &lat_raw, &ns, &lon_raw, &ew, &alt, &spd);

                ESP_LOGI(TAG, "[GPS] CGNSSINFO parse: fix=%d sats=GPS:%d/GLO:%d/BDS:%d lat=%.4f%c lon=%.4f%c alt=%.1f",
                         fix_mode, gps_svs, glo_svs, bds_svs, lat_raw, ns, lon_raw, ew, alt);

                if (parsed >= 8 && fix_mode >= 1 && lat_raw > 0 && lon_raw > 0) {
                    int lat_deg = (int)(lat_raw / 100);
                    double lat_min = lat_raw - (lat_deg * 100);
                    gps_out->latitude = lat_deg + (lat_min / 60.0);
                    if (ns == 'S') gps_out->latitude = -gps_out->latitude;

                    int lon_deg = (int)(lon_raw / 100);
                    double lon_min = lon_raw - (lon_deg * 100);
                    gps_out->longitude = lon_deg + (lon_min / 60.0);
                    if (ew == 'W') gps_out->longitude = -gps_out->longitude;

                    gps_out->altitude = alt;
                    gps_out->speed_kmh = spd;
                    gps_out->valid = true;

                    ESP_LOGI(TAG, "[GPS] FIX OBTIDO (CGNSSINFO): Lat=%.6f, Lon=%.6f, Alt=%.1fm",
                             gps_out->latitude, gps_out->longitude, gps_out->altitude);
                    return ESP_OK;
                }
            }
        }
    }

    ESP_LOGI(TAG, "[GPS] Nenhum fix valido disponivel.");
    gps_out->valid = false;
    return ESP_ERR_NOT_FOUND;
}

esp_err_t simcom_driver_gps_power_on(void) {
    if (gps_powered_on) return ESP_OK;

    ESP_LOGI(TAG, "[GPS] Ativando receptor GNSS celular (Cold Start)...");
    esp_err_t err = at_send_cmd("AT+CGNSSPWR=1\r\n", "OK", NULL, 0, 9000);
    if (err != ESP_OK) {
        err = at_send_cmd("AT+CGPS=1\r\n", "OK", NULL, 0, 9000);
    }

    if (err == ESP_OK) {
        gps_powered_on = true;
        ESP_LOGI(TAG, "[GPS] GNSS ligado com sucesso.");
    }
    return err;
}

esp_err_t simcom_driver_gps_power_off(void) {
    if (!gps_powered_on) return ESP_OK;

    ESP_LOGI(TAG, "[GPS] Desligando receptor GNSS...");
    esp_err_t err = at_send_cmd("AT+CGNSSPWR=0\r\n", "OK", NULL, 0, 9000);
    if (err != ESP_OK) {
        err = at_send_cmd("AT+CGPS=0\r\n", "OK", NULL, 0, 9000);
    }

    if (err == ESP_OK) {
        gps_powered_on = false;
        ESP_LOGI(TAG, "[GPS] GNSS desligado.");
    }
    return err;
}

/* --- Metricas e Diagnosticos Cellular --- */

static esp_err_t query_cpsi_metrics(void) {
    char resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err = at_send_cmd("AT+CPSI?\r\n", "+CPSI:", resp, sizeof(resp), 5000);
    if (err != ESP_OK) return err;

    char *p = strstr(resp, "+CPSI:");
    if (p == NULL) return ESP_FAIL;

    p += 6;
    while (*p == ' ') p++;

    if (strncmp(p, "LTE", 3) == 0) {
        char *fields[20] = {0};
        fields[0] = p;
        int f_idx = 1;
        char *c = p;

        while (*c != '\0' && f_idx < 20) {
            if (*c == ',') {
                *c = '\0';
                fields[f_idx++] = c + 1;
            }
            c++;
        }

        if (f_idx >= 15) {
            cached_tac = atoi(fields[2]);
            cached_cid = atoi(fields[3]);
            cached_earfcn = atoi(fields[4]);
            cell_tower_valid = (cached_cid != 0);
            cached_rsrq = atoi(fields[11]);
            cached_rsrp = atoi(fields[12]);
            int rssi_cpsi = atoi(fields[13]);
            if (rssi_cpsi != 0) {
                cached_rssi = rssi_cpsi;
            }
            cached_sinr = atoi(fields[14]);
            return ESP_OK;
        }
    }
    return ESP_FAIL;
}

/**
 * @brief Obtem localizacao approximada via torre celular (Mozilla Location Service).
 *
 * Usa MCC, MNC, TAC, CID e EARFCN para consultar a API do Mozilla.
 * Requer conexao ativa (Wi-Fi ou celular com dados).
 *
 * @param[out] lat Latitude obtida
 * @param[out] lon Longitude obtida
 * @return ESP_OK se obteve localizacao, ESP_FAIL caso contrario
 */
static esp_err_t cell_tower_get_location(double *lat, double *lon) {
    if (!cell_tower_valid || cached_cid == 0) {
        return ESP_ERR_INVALID_STATE;
    }

    /* Monta JSON para Mozilla Location Service */
    cJSON *root = cJSON_CreateObject();
    cJSON *cellests = cJSON_AddArrayToObject(root, "cellTowers");

    cJSON *cell = cJSON_CreateObject();
    cJSON_AddNumberToObject(cell, "mobileCountryCode", cached_mcc);
    cJSON_AddNumberToObject(cell, "mobileNetworkCode", cached_mnc);
    cJSON_AddNumberToObject(cell, "locationAreaCode", cached_tac);
    cJSON_AddNumberToObject(cell, "cellId", cached_cid);
    cJSON_AddNumberToObject(cell, "age", 0);
    cJSON_AddNumberToObject(cell, "signalStrength", cached_rsrp);
    cJSON_AddNumberToObject(cell, "timingAdvance", 0);
    cJSON_AddItemToArray(cellests, cell);

    char *post_data = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);

    if (!post_data) return ESP_FAIL;

    ESP_LOGI(TAG, "MLS Request: MCC=%d MNC=%d TAC=%d CID=%d EARFCN=%d",
             cached_mcc, cached_mnc, cached_tac, cached_cid, cached_earfcn);

    /* Buffer para resposta */
    char response_buf[512];
    memset(response_buf, 0, sizeof(response_buf));

    esp_http_client_config_t http_config = {
        .url = "https://location.services.mozilla.com/v1/geolocate?key=test",
        .method = HTTP_METHOD_POST,
        .timeout_ms = 10000,
    };

    esp_http_client_handle_t client = esp_http_client_init(&http_config);
    if (!client) {
        free(post_data);
        return ESP_FAIL;
    }

    esp_http_client_set_header(client, "Content-Type", "application/json");
    esp_err_t err = esp_http_client_open(client, strlen(post_data));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "MLS HTTP open falhou: %s", esp_err_to_name(err));
        esp_http_client_cleanup(client);
        free(post_data);
        return err;
    }

