malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
    int written = esp_http_client_write(client, post_data, strlen(post_data));
    free(post_data);

    if (written < 0) {
        ESP_LOGE(TAG, "MLS HTTP write falhou");
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        return ESP_FAIL;
    }

    int read_len = esp_http_client_read(client, response_buf, sizeof(response_buf) - 1);
    esp_http_client_close(client);
    esp_http_client_cleanup(client);

    if (read_len <= 0) {
        ESP_LOGW(TAG, "MLS: Sem resposta HTTP");
        return ESP_FAIL;
    }
    response_buf[read_len] = '\0';

    /* Parse da resposta: {"location":{"lat":-23.55,"lng":-46.63},"accuracy":1500} */
    cJSON *resp_root = cJSON_Parse(response_buf);
    if (!resp_root) {
        ESP_LOGW(TAG, "MLS: JSON parse falhou");
        return ESP_FAIL;
    }

    cJSON *location = cJSON_GetObjectItem(resp_root, "location");
    if (!location) {
        cJSON_Delete(resp_root);
        ESP_LOGW(TAG, "MLS: campo 'location' ausente");
        return ESP_FAIL;
    }

    cJSON *lat_json = cJSON_GetObjectItem(location, "lat");
    cJSON *lng_json = cJSON_GetObjectItem(location, "lng");
    if (!lat_json || !lng_json) {
        cJSON_Delete(resp_root);
        ESP_LOGW(TAG, "MLS: campos lat/lng ausentes");
        return ESP_FAIL;
    }

    *lat = lat_json->valuedouble;
    *lon = lng_json->valuedouble;

    cJSON *accuracy = cJSON_GetObjectItem(resp_root, "accuracy");
    int acc = accuracy ? accuracy->valueint : -1;

    ESP_LOGI(TAG, "MLS: lat=%.6f lon=%.6f accuracy=%dm", *lat, *lon, acc);
    cJSON_Delete(resp_root);
    return ESP_OK;
}

static esp_err_t query_ceer_log(void) {
    char resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err = at_send_cmd("AT+CEER\r\n", "+CEER:", resp, sizeof(resp), 5000);
    if (err != ESP_OK) return err;

    char *p = strstr(resp, "+CEER:");
    if (p == NULL) return ESP_FAIL;

    p += 6;
    while (*p == ' ' || *p == '"') p++;

    int idx = 0;
    while (p[idx] != '\0' && p[idx] != '\r' && p[idx] != '\n' && p[idx] != '"' && idx < sizeof(cached_ceer) - 1) {
        cached_ceer[idx] = p[idx];
        idx++;
    }
    cached_ceer[idx] = '\0';

    while (idx > 0 && cached_ceer[idx - 1] == ' ') {
        cached_ceer[idx - 1] = '\0';
        idx--;
    }
    return ESP_OK;
}

esp_err_t simcom_driver_get_signal_quality(int *rssi, int *ber) {
    char resp[128];
    esp_err_t err = at_send_cmd("AT+CSQ\r\n", "+CSQ:", resp, sizeof(resp), 9000);
    if (err != ESP_OK) return err;

    char *p = strstr(resp, "+CSQ:");
    if (p != NULL) {
        p += 5;
        int r = 99, b = -1;
        if (sscanf(p, "%d,%d", &r, &b) == 2) {
            if (r != 99) {
                // Converte RSSI AT para dBm
                cached_rssi = -113 + (r * 2);
            } else {
                cached_rssi = 99;
            }
            cached_ber = b;
            if (rssi) *rssi = cached_rssi;
            if (ber) *ber = cached_ber;
            return ESP_OK;
        }
    }
    return ESP_FAIL;
}

esp_err_t simcom_driver_get_network_info(cellular_tech_t *tech, int *mcc,
                                         int *mnc, char *operator_name) {
    // Tenta extrair info via comando de operador
    char resp[256];
    esp_err_t err = at_send_cmd("AT+COPS?\r\n", "+COPS:", resp, sizeof(resp), 65000);
    if (err == ESP_OK) {
        char *p = strstr(resp, "+COPS:");
        if (p != NULL) {
            p += 6;
            int mode = 0, format = 0;
            char op[32] = "";
            int act = -1;
            // Formato: +COPS: <mode>,<format>,"<oper>",<act>
            int parsed = sscanf(p, "%d,%d,\"%[^\"]\",%d", &mode, &format, op, &act);
            if (parsed >= 3) {
                strncpy(cached_operator_name, op, sizeof(cached_operator_name) - 1);
                if (act == 0) cached_tech = CELLULAR_TECH_2G;
                else if (act == 2) cached_tech = CELLULAR_TECH_3G;
                else if (act == 7) cached_tech = CELLULAR_TECH_4G_LTE;
                else if (act == 9) cached_tech = CELLULAR_TECH_NB_IOT;
            }
        }
    }

    query_cpsi_metrics();

    if (tech) *tech = cached_tech;
    if (operator_name) strncpy(operator_name, cached_operator_name, 31);
    
    // Leitura MNC/MCC
    char info_resp[128];
    if (at_send_cmd("AT+CIMI\r\n", "OK", info_resp, sizeof(info_resp), 5000) == ESP_OK) {
        char cimi[32];
        extract_digits(info_resp, cimi, sizeof(cimi));
        if (strlen(cimi) >= 5) {
            char mcc_str[4] = {cimi[0], cimi[1], cimi[2], '\0'};
            char mnc_str[3] = {cimi[3], cimi[4], '\0'};
            cached_mcc = atoi(mcc_str);
            cached_mnc = atoi(mnc_str);
        }
    }

    if (mcc) *mcc = cached_mcc;
    if (mnc) *mnc = cached_mnc;
    return ESP_OK;
}

esp_err_t simcom_driver_get_status(cellular_status_t *status) {
    if (status == NULL) return ESP_ERR_INVALID_ARG;

    status->rssi = cached_rssi;
    status->ber = cached_ber;
    status->tech = cached_tech;
    status->mcc = cached_mcc;
    status->mnc = cached_mnc;
    strncpy(status->operator_name, cached_operator_name, sizeof(status->operator_name) - 1);
    status->registered = (modem_state >= SIMCOM_STATE_REGISTERED);
    status->roaming = false;
    status->tx_bytes = 0;
    status->rx_bytes = 0;
    status->modem_state = modem_state;
    status->rsrp = cached_rsrp;
    status->rsrq = cached_rsrq;
    status->sinr = cached_sinr;
    strncpy(status->ceer, cached_ceer, sizeof(status->ceer) - 1);

    return ESP_OK;
}

esp_err_t simcom_driver_diagnostic_json(char *json_buf, size_t buf_size) {
    cellular_status_t st;
    simcom_driver_get_status(&st);

    const char *tech_str = "NENHUM";
    if (st.tech == CELLULAR_TECH_2G) tech_str = "2G";
    else if (st.tech == CELLULAR_TECH_3G) tech_str = "3G";
    else if (st.tech == CELLULAR_TECH_4G_LTE) tech_str = "4G_LTE";
    else if (st.tech == CELLULAR_TECH_NB_IOT) tech_str = "NB_IOT";

    snprintf(json_buf, buf_size,
             "{\"rssi\":%d,\"ber\":%d,\"tech\":\"%s\",\"mcc\":%d,\"mnc\":%d,\"operator\":\"%s\",\"state\":%d,\"rsrp\":%d,\"rsrq\":%d,\"sinr\":%d,\"ceer\":\"%s\"}",
             st.rssi, st.ber, tech_str, st.mcc, st.mnc, st.operator_name, st.modem_state, st.rsrp, st.rsrq, st.sinr, st.ceer);

    return ESP_OK;
}

const char* simcom_driver_get_imei(void) { return modem_imei; }

