malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
esp_err_t simcom_driver_get_msisdn(char *msisdn, size_t max_len) {
    if (msisdn == NULL || max_len == 0) return ESP_ERR_INVALID_ARG;
    msisdn[0] = '\0';

    char resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err = at_send_cmd("AT+CNUM\r\n", "+CNUM:", resp, sizeof(resp), 9000);
    if (err == ESP_OK) {
        char number[32] = {0};
        if (sscanf(resp, "%*[^+]+CNUM:%*[^,],\"%31[^\"]\"", number) >= 1 ||
            sscanf(resp, "%*[^+]+CNUM:%*[^,],%31[^,\r]", number) >= 1) {
            if (number[0] != '\0') {
                strncpy(msisdn, number, max_len - 1);
                ESP_LOGI(TAG, "MSISDN lido: %s", msisdn);
                return ESP_OK;
            }
        }
    }

    // Fallback: tenta AT+CPBS="ON" + AT+CPBR=1
    ESP_LOGD(TAG, "AT+CNUM falhou. Tentando CPBS=ON + CPBR=1...");
    if (at_send_cmd("AT+CPBS=\"ON\"\r\n", "OK", NULL, 0, 5000) == ESP_OK) {
        char cpbr_resp[256];
        if (at_send_cmd("AT+CPBR=1\r\n", "+CPBR:", cpbr_resp, sizeof(cpbr_resp), 5000) == ESP_OK) {
            char number[32] = {0};
            if (sscanf(cpbr_resp, "%*[^+]+CPBR:%*d,\"%31[^\"]\"", number) >= 1) {
                if (number[0] != '\0') {
                    strncpy(msisdn, number, max_len - 1);
                    ESP_LOGI(TAG, "MSISDN lido via CPBR: %s", msisdn);
                    return ESP_OK;
                }
            }
        }
    }

    ESP_LOGD(TAG, "MSISDN nao disponivel no chip.");
    return ESP_ERR_NOT_FOUND;
}

esp_err_t simcom_driver_sync_time_from_tower(void) {
    char resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err;

    at_send_cmd("AT+CTZU=1\r\n", "OK", NULL, 0, 2000);

    err = at_send_cmd("AT+CCLK?\r\n", "+CCLK:", resp, sizeof(resp), 5000);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Falha ao ler hora da torre celular (AT+CCLK?).");
        return err;
    }

    char *p = strstr(resp, "+CCLK:");
    if (p == NULL) return ESP_ERR_NOT_FOUND;
    
    p += 6;
    while (*p == ' ' || *p == '"') p++;

    int yy, MM, dd, hh, mm, ss, tz_h;
    char tz_sign = 0;
    int parsed = sscanf(p, "%d/%d/%d,%d:%d:%d%c%d",
                        &yy, &MM, &dd, &hh, &mm, &ss, &tz_sign, &tz_h);
    if (parsed < 6) return ESP_ERR_INVALID_RESPONSE;

    struct tm tm_val = {0};
    tm_val.tm_year = yy + 100;
    tm_val.tm_mon  = MM - 1;
    tm_val.tm_mday = dd;
    tm_val.tm_hour = hh;
    tm_val.tm_min  = mm;
    tm_val.tm_sec  = ss;

    // Salva e limpa TZ para mktime nao aplicar offset local
    char *saved_tz = getenv("TZ");
    unsetenv("TZ");
    tzset();

    time_t now = mktime(&tm_val);

    // Restaura TZ
    if (saved_tz) {
        setenv("TZ", saved_tz, 1);
        tzset();
    }

    if (now < 1700000000) return ESP_ERR_INVALID_RESPONSE;

    // Converte hora local (da torre) para UTC usando o offset do AT+CCLK
    if (tz_sign != 0) {
        // tz_h do AT+CCLK é em quarter-hours (3GPP TS 27.007)
        int tz_offset_sec = (tz_h > 14) ? (tz_h * 900) : (tz_h * 3600);
        if (tz_sign == '-') tz_offset_sec = -tz_offset_sec;
        now -= tz_offset_sec; // local - (-offset) = local + offset = UTC
    }

    struct timeval tv = { .tv_sec = now, .tv_usec = 0 };
    err = settimeofday(&tv, NULL);
    if (err != 0) return ESP_FAIL;

    ESP_LOGI(TAG, "Relogio ajustado via torre celular: %04d-%02d-%02d %02d:%02d:%02d UTC",
             2000 + yy, MM, dd, hh, mm, ss);
    return ESP_OK;
}

esp_err_t simcom_driver_select_sim(int slot) {
    if (slot != 0 && slot != 1) return ESP_ERR_INVALID_ARG;

    ESP_LOGI(TAG, "Selecionando SIM Slot %d...", slot);
    
    // CFUN=0 -> Troca Slot -> CFUN=1
    at_send_cmd("AT+CFUN=0\r\n", "OK", NULL, 0, 5000);
    vTaskDelay(pdMS_TO_TICKS(500));

    char cmd[64];
    snprintf(cmd, sizeof(cmd), "AT*SELECTSIMSLOT=%d\r\n", slot);
    esp_err_t err = at_send_cmd(cmd, "OK", NULL, 0, 5000);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Falha ao selecionar SIM Slot %d.", slot);
        at_send_cmd("AT+CFUN=1\r\n", "OK", NULL, 0, 5000);
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(500));
    at_send_cmd("AT+CFUN=1\r\n", "OK", NULL, 0, 5000);
    vTaskDelay(pdMS_TO_TICKS(5000)); // Espera registro inicial

    char sim_resp[128];
    err = at_send_cmd("AT+CPIN?\r\n", "READY", sim_resp, sizeof(sim_resp), 5000);
    bool sim_found = (err == ESP_OK);

    char detected_ccid[32] = "";
    if (sim_found) {
        simcom_driver_get_ccid(detected_ccid, sizeof(detected_ccid));
    } else {
        strcpy(detected_ccid, "UNKNOWN");
    }

    bastao_current_status.sim_present = sim_found;
    bastao_current_status.active_sim_slot = sim_found ? slot : bastao_current_status.active_sim_slot;
    strncpy(bastao_current_status.sim_ccid, detected_ccid, sizeof(bastao_current_status.sim_ccid) - 1);

    if (sim_found) {
        modem_state = SIMCOM_STATE_AT_READY;
        if (stored_apn.apn[0] != '\0') {
            simcom_driver_configure_apn(&stored_apn);
        }
        return ESP_OK;
    }

    return ESP_FAIL;
}

/* --- SMS de Contingencia --- */

static void process_sms_command(int index, const char *sender, const char *body) {
    ESP_LOGI(TAG, "SMS Comando Recebido: %s de %s (index %d)", body, sender, index);
    
    char resp_msg[256] = {0};
    bool reply_needed = false;
    char body_upper[128] = {0};
    strncpy(body_upper, body, sizeof(body_upper) - 1);
    
    // Converte para upper case
    for (int i = 0; body_upper[i]; i++) {
        if (body_upper[i] >= 'a' && body_upper[i] <= 'z') {
            body_upper[i] = body_upper[i] - 'a' + 'A';
        }
    }

    if (strcmp(body_upper, "BUZZER") == 0) {
        stm32_cmd_send_buzzer(STM32_CMD_BUZZER_DOUBLE);
        snprintf(resp_msg, sizeof(resp_msg), "Buzzer acionado com sucesso.");
        reply_needed = true;
    } else if (strncmp(body_upper, "RFID", 4) == 0) {
        if (strstr(body_upper, "ON") != NULL || strstr(body_upper, "1") != NULL) {
            stm32_cmd_send_rfid_power(1);
            snprintf(resp_msg, sizeof(resp_msg), "RFID ligado.");
        } else {
            stm32_cmd_send_rfid_power(0);
            snprintf(resp_msg, sizeof(resp_msg), "RFID desligado.");
        }
        reply_needed = true;
    } else if (strcmp(body_upper, "STATUS") == 0) {
        snprintf(resp_msg, sizeof(resp_msg),
                 "Bat:%.2fV, Cell:%s, Tags:%lu, SIM Slot:%d, GPS:%s (Lat:%.6f, Lon:%.6f)",
                 bastao_current_status.battery_voltage,
                 cellular_mqtt_connected ? "MQTT_OK" : "NO_MQTT",
                 (unsigned long)bastao_current_status.tags_read_count,
                 bastao_current_status.active_sim_slot,
                 bastao_current_status.gps_fix ? "OK" : "NO_FIX",
                 bastao_current_status.gps_latitude,
                 bastao_current_status.gps_longitude);
        reply_needed = true;
    } else if (strcmp(body_upper, "RESTART") == 0) {
        simcom_driver_send_sms(sender, "Reiniciando ESP32...");
        vTaskDelay(pdMS_TO_TICKS(2000));
        esp_restart();
    }

    if (reply_needed) {
        simcom_driver_send_sms(sender, resp_msg);
    }

