malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
                // Verifica roaming via CREG
                char creg[128];
                if (at_send_cmd("AT+CREG?\r\n", "+CREG:", creg, sizeof(creg), 3000) == ESP_OK) {
                    if (strstr(creg, ",5)") != NULL || strstr(creg, ",5\r") != NULL || strstr(creg, ",5\n") != NULL) {
                        ESP_LOGW(TAG, "Watchdog: Slot %d em roaming (CREG stat=5). Sinal=%d dBm", slot, rssi);
                    }
                }

                // Sinal muito baixo: acumula contador de falha
                if (rssi < -100) { // -100dBm ou pior = praticamente sem sinal
                    signal_fail_count++;
                    ESP_LOGW(TAG, "Watchdog: Sinal baixo slot %d (rssi=%ddBm). Fail=%d/5",
                             slot, rssi, signal_fail_count);
                } else {
                    signal_fail_count = 0; // reset se sinal voltou
                }
            }
        }

        // Troca de chip por sinal baixo persistente
        if (signal_fail_count >= 5) {
            int other = (bastao_current_status.active_sim_slot == 0) ? 1 : 0;
            ESP_LOGW(TAG, "Watchdog: Sinal baixo persistente slot %d. Trocando para slot %d...",
                     bastao_current_status.active_sim_slot, other);
            signal_fail_count = 0;
            simcom_driver_select_sim(other);
            // Reconfigura APN + MQTT no novo slot
            if (stored_apn.apn[0] != '\0') {
                simcom_driver_configure_apn(&stored_apn);
            }
            if (cellular_mqtt_connected || mqtt_config_loaded) {
                cellular_mqtt_connected = false;
                if (mqtt_config_loaded) {
                    simcom_driver_mqtt_connect(&stored_mqtt_config);
                }
            }
            connection_attempt_start = xTaskGetTickCount();
            continue;
        }

        // Recuperacao da Maquina de Estados
        if (modem_state == SIMCOM_STATE_OFF || modem_state == SIMCOM_STATE_ERROR) {
            if (simcom_driver_init() != ESP_OK) {
                continue;
            }
        }

        // Processa SMS mesmo se nao conectado ao MQTT
        if (modem_state >= SIMCOM_STATE_AT_READY) {
            simcom_driver_check_and_process_sms();
        }

        if (modem_state == SIMCOM_STATE_AT_READY) {
            if (stored_apn.apn[0] != '\0') {
                simcom_driver_configure_apn(&stored_apn);
            }
        }

        if (modem_state == SIMCOM_STATE_REGISTERED) {
            if (mqtt_config_loaded) {
                simcom_driver_mqtt_connect(&stored_mqtt_config);
            }
        }

        // Atualiza informacoes lentas de rede a cada 5 minutos (30 iteracoes * 10s = 300s)
        net_info_counter++;
        if (net_info_counter >= 30 || cached_operator_name[0] == '\0') {
            net_info_counter = 0;
            if (modem_state >= SIMCOM_STATE_REGISTERED) {
                simcom_driver_get_network_info(NULL, NULL, NULL, NULL);
                query_ceer_log();
            }
        }
    }
}

BaseType_t simcom_driver_watchdog_start(UBaseType_t priority) {
    return xTaskCreatePinnedToCore(simcom_watchdog_task, "simcom_wd", 6144, NULL, priority, NULL, 1);
}

void simcom_driver_set_suspended(bool suspend) {
    cellular_suspended = suspend;
    if (suspend) {
        ESP_LOGI(TAG, "Conectividade celular suspensa (Wi-Fi ativa). Desconectando MQTT...");
        simcom_driver_mqtt_disconnect();
    } else {
        ESP_LOGI(TAG, "Conectividade celular retomada.");
    }
}

bool simcom_driver_is_suspended(void) { return cellular_suspended; }

bool simcom_driver_has_location(void) {
    /* Localizacao disponivel: GPS com fix OU torre celular valida */
    return bastao_current_status.gps_fix || cell_tower_valid;
}

esp_err_t simcom_driver_get_cell_tower_location(double *lat, double *lon) {
    return cell_tower_get_location(lat, lon);
}

bool simcom_driver_is_cell_tower_valid(void) {
    return cell_tower_valid;
}
